app/Models/Post.php

    public static function findOrFail($id)
    {
        $post = static::all()->firstWhere('id', $id);
---
SELECT * FROM `posts`